Revit 2027 API
WaterType Enumeration
 The enumerated type representing the permitted values for the asset property "WaterType" from the "Water" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum WaterType
Public Enumeration WaterType
public enum class WaterType
type WaterType
Members
Member name | Value | Description
Lake | 3
Ocean | 4
ReflectingPool | 1
River | 2
SwimmingPool | 0
See Also
Reference
Autodesk.Revit.DB.Visual Namespace